using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace GoWork.Migrations
{
    /// <inheritdoc />
    public partial class SeedCountries2 : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql(@"
SET IDENTITY_INSERT [TbCountries] ON;
INSERT INTO [TbCountries] ([Id],[Name],[Code],[IsActive]) VALUES
(1,N'أفغانستان','AF',1),(2,N'ألبانيا','AL',1),(3,N'الجزائر','DZ',1),(4,N'أندورا','AD',1),(5,N'أنغولا','AO',1),
(6,N'الأرجنتين','AR',1),(7,N'أرمينيا','AM',1),(8,N'أستراليا','AU',1),(9,N'النمسا','AT',1),(10,N'أذربيجان','AZ',1),
(11,N'البحرين','BH',1),(12,N'بنغلاديش','BD',1),(13,N'بيلاروسيا','BY',1),(14,N'بلجيكا','BE',1),(15,N'بنين','BJ',1),
(16,N'بوتان','BT',1),(17,N'بوليفيا','BO',1),(18,N'البوسنة والهرسك','BA',1),(19,N'بوتسوانا','BW',1),(20,N'البرازيل','BR',1),
(21,N'بروناي','BN',1),(22,N'بلغاريا','BG',1),(23,N'بوركينا فاسو','BF',1),(24,N'بوروندي','BI',1),(25,N'كمبوديا','KH',1),
(26,N'الكاميرون','CM',1),(27,N'كندا','CA',1),(28,N'تشاد','TD',1),(29,N'تشيلي','CL',1),(30,N'الصين','CN',1),
(31,N'كولومبيا','CO',1),(32,N'جزر القمر','KM',1),(33,N'الكونغو','CG',1),(34,N'كوستاريكا','CR',1),(35,N'كرواتيا','HR',1),
(36,N'كوبا','CU',1),(37,N'قبرص','CY',1),(38,N'التشيك','CZ',1),(39,N'الدنمارك','DK',1),(40,N'جيبوتي','DJ',1),
(41,N'جمهورية الدومينيكان','DO',1),(42,N'الإكوادور','EC',1),(43,N'مصر','EG',1),(44,N'السلفادور','SV',1),(45,N'إريتريا','ER',1),
(46,N'إستونيا','EE',1),(47,N'إثيوبيا','ET',1),(48,N'فيجي','FJ',1),(49,N'فنلندا','FI',1),(50,N'فرنسا','FR',1),
(51,N'الغابون','GA',1),(52,N'غامبيا','GM',1),(53,N'جورجيا','GE',1),(54,N'ألمانيا','DE',1),(55,N'غانا','GH',1),
(56,N'اليونان','GR',1),(57,N'غواتيمالا','GT',1),(58,N'غينيا','GN',1),(59,N'غويانا','GY',1),(60,N'هايتي','HT',1),
(61,N'هندوراس','HN',1),(62,N'المجر','HU',1),(63,N'آيسلندا','IS',1),(64,N'الهند','IN',1),(65,N'إندونيسيا','ID',1),
(66,N'إيران','IR',1),(67,N'العراق','IQ',1),(68,N'أيرلندا','IE',1),(69,N'إيطاليا','IT',1),(70,N'جامايكا','JM',1),
(71,N'اليابان','JP',1),(72,N'الأردن','JO',1),(73,N'كازاخستان','KZ',1),(74,N'كينيا','KE',1),(75,N'الكويت','KW',1),
(76,N'قيرغيزستان','KG',1),(77,N'لاوس','LA',1),(78,N'لاتفيا','LV',1),(79,N'لبنان','LB',1),(80,N'ليبيا','LY',1),
(81,N'ليتوانيا','LT',1),(82,N'لوكسمبورغ','LU',1),(83,N'مدغشقر','MG',1),(84,N'مالاوي','MW',1),(85,N'ماليزيا','MY',1),
(86,N'جزر المالديف','MV',1),(87,N'مالي','ML',1),(88,N'مالطا','MT',1),(89,N'موريتانيا','MR',1),(90,N'موريشيوس','MU',1),
(91,N'المكسيك','MX',1),(92,N'مولدوفا','MD',1),(93,N'موناكو','MC',1),(94,N'منغوليا','MN',1),(95,N'الجبل الأسود','ME',1),
(96,N'المغرب','MA',1),(97,N'موزمبيق','MZ',1),(98,N'ميانمار','MM',1),(99,N'ناميبيا','NA',1),(100,N'نيبال','NP',1),
(101,N'هولندا','NL',1),(102,N'نيوزيلندا','NZ',1),(103,N'نيكاراغوا','NI',1),(104,N'النيجر','NE',1),(105,N'نيجيريا','NG',1),
(106,N'كوريا الشمالية','KP',1),(107,N'مقدونيا الشمالية','MK',1),(108,N'النرويج','NO',1),(109,N'سلطنة عمان','OM',1),(110,N'باكستان','PK',1),
(111,N'فلسطين','PS',1),(112,N'بنما','PA',1),(113,N'باراغواي','PY',1),(114,N'بيرو','PE',1),(115,N'الفلبين','PH',1),
(116,N'بولندا','PL',1),(117,N'البرتغال','PT',1),(118,N'قطر','QA',1),(119,N'رومانيا','RO',1),(120,N'روسيا','RU',1),
(121,N'رواندا','RW',1),(122,N'السعودية','SA',1),(123,N'السنغال','SN',1),(124,N'صربيا','RS',1),(125,N'سيراليون','SL',1),
(126,N'سنغافورة','SG',1),(127,N'سلوفاكيا','SK',1),(128,N'سلوفينيا','SI',1),(129,N'الصومال','SO',1),(130,N'جنوب أفريقيا','ZA',1),
(131,N'كوريا الجنوبية','KR',1),(132,N'جنوب السودان','SS',1),(133,N'إسبانيا','ES',1),(134,N'سريلانكا','LK',1),(135,N'السودان','SD',1),
(136,N'السويد','SE',1),(137,N'سويسرا','CH',1),(138,N'سوريا','SY',1),(139,N'تايوان','TW',1),(140,N'طاجيكستان','TJ',1),
(141,N'تنزانيا','TZ',1),(142,N'تايلاند','TH',1),(143,N'توجو','TG',1),(144,N'تونس','TN',1),(145,N'تركيا','TR',1),
(146,N'تركمانستان','TM',1),(147,N'أوغندا','UG',1),(148,N'أوكرانيا','UA',1),(149,N'الإمارات العربية المتحدة','AE',1),(150,N'المملكة المتحدة','GB',1),
(151,N'الولايات المتحدة','US',1),(152,N'الأوروغواي','UY',1),(153,N'أوزبكستان','UZ',1),(154,N'فنزويلا','VE',1),(155,N'فيتنام','VN',1),
(156,N'اليمن','YE',1),(157,N'زامبيا','ZM',1),(158,N'زيمبابوي','ZW',1),(159,N'جزر البهاما','BS',1),(160,N'باربادوس','BB',1),
(161,N'بليز','BZ',1),(162,N'الرأس الأخضر','CV',1),(163,N'جمهورية أفريقيا الوسطى','CF',1),(164,N'جمهورية الكونغو الديمقراطية','CD',1),
(165,N'ساحل العاج','CI',1),(166,N'دومينيكا','DM',1),(167,N'تيمور الشرقية','TL',1),(168,N'غينيا الاستوائية','GQ',1),
(169,N'غرينادا','GD',1),(170,N'غينيا بيساو','GW',1),(171,N'ليسوتو','LS',1),(172,N'ليبيريا','LR',1),
(173,N'ليختنشتاين','LI',1),(174,N'ميكرونيزيا','FM',1),(175,N'بالاو','PW',1),(176,N'بابوا غينيا الجديدة','PG',1),
(177,N'سانت لوسيا','LC',1),(178,N'ساموا','WS',1),(179,N'سان مارينو','SM',1),(180,N'ساو تومي وبرينسيب','ST',1),
(181,N'سيشل','SC',1),(182,N'جزر سليمان','SB',1),(183,N'سورينام','SR',1),(184,N'إسواتيني','SZ',1),
(185,N'تونغا','TO',1),(186,N'ترينيداد وتوباغو','TT',1),(187,N'توفالو','TV',1),(188,N'فانواتو','VU',1),
(189,N'الفاتيكان','VA',1),(190,N'أنتيغوا وبربودا','AG',1),(191,N'جزر مارشال','MH',1),
(192,N'ناورو','NR',1),(193,N'كيريباتي','KI',1),(194,N'سانت كيتس ونيفيس','KN',1),(195,N'سانت فينسنت والغرينادين','VC',1);
SET IDENTITY_INSERT [TbCountries] OFF;
            ");
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
