using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace GoWork.Migrations
{
    /// <inheritdoc />
    public partial class SeedGovernates2 : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.Sql(@"
SET IDENTITY_INSERT [TbGovernates] ON;
INSERT INTO [TbGovernates] ([Id],[CountryId],[Name]) VALUES
(1,122,N'الرياض'),(2,122,N'مكة المكرمة'),(3,122,N'المدينة المنورة'),(4,122,N'المنطقة الشرقية'),(5,122,N'عسير'),
(6,122,N'تبوك'),(7,122,N'حائل'),(8,122,N'الحدود الشمالية'),(9,122,N'جازان'),(10,122,N'نجران'),
(11,122,N'الباحة'),(12,122,N'الجوف'),(13,122,N'القصيم'),
(14,149,N'أبو ظبي'),(15,149,N'دبي'),(16,149,N'الشارقة'),(17,149,N'عجمان'),(18,149,N'رأس الخيمة'),
(19,149,N'الفجيرة'),(20,149,N'أم القيوين'),
(21,43,N'القاهرة'),(22,43,N'الجيزة'),(23,43,N'الإسكندرية'),(24,43,N'القليوبية'),(25,43,N'الدقهلية'),
(26,43,N'الشرقية'),(27,43,N'الغربية'),(28,43,N'المنوفية'),(29,43,N'البحيرة'),(30,43,N'كفر الشيخ'),
(31,43,N'دمياط'),(32,43,N'بورسعيد'),(33,43,N'الإسماعيلية'),(34,43,N'السويس'),(35,43,N'جنوب سيناء'),
(36,43,N'شمال سيناء'),(37,43,N'الفيوم'),(38,43,N'بني سويف'),(39,43,N'المنيا'),(40,43,N'أسيوط'),
(41,43,N'سوهاج'),(42,43,N'قنا'),(43,43,N'الأقصر'),(44,43,N'أسوان'),(45,43,N'البحر الأحمر'),(46,43,N'الوادي الجديد'),(47,43,N'مطروح'),
(48,72,N'عمان'),(49,72,N'إربد'),(50,72,N'الزرقاء'),(51,72,N'البلقاء'),(52,72,N'المفرق'),
(53,72,N'جرش'),(54,72,N'عجلون'),(55,72,N'الكرك'),(56,72,N'الطفيلة'),(57,72,N'معان'),(58,72,N'العقبة'),(59,72,N'مادبا'),
(60,75,N'العاصمة'),(61,75,N'حولي'),(62,75,N'الفروانية'),(63,75,N'مبارك الكبير'),
(64,75,N'الأحمدي'),(65,75,N'الجهراء'),
(66,11,N'العاصمة'),(67,11,N'المحرق'),(68,11,N'الشمالية'),(69,11,N'الجنوبية'),
(70,118,N'الدوحة'),(71,118,N'الريان'),(72,118,N'الوكرة'),(73,118,N'الخور'),(74,118,N'أم صلال'),
(75,118,N'الضعاين'),(76,118,N'الشمال'),(77,118,N'الشحانية'),
(78,109,N'مسقط'),(79,109,N'ظفار'),(80,109,N'مسندم'),(81,109,N'البريمي'),(82,109,N'الداخلية'),
(83,109,N'شمال الباطنة'),(84,109,N'جنوب الباطنة'),(85,109,N'شمال الشرقية'),(86,109,N'جنوب الشرقية'),
(87,109,N'الظاهرة'),(88,109,N'الوسطى'),
(89,67,N'بغداد'),(90,67,N'البصرة'),(91,67,N'نينوى'),(92,67,N'أربيل'),(93,67,N'السليمانية'),
(94,67,N'دهوك'),(95,67,N'كركوك'),(96,67,N'ديالى'),(97,67,N'الأنبار'),(98,67,N'واسط'),
(99,67,N'النجف'),(100,67,N'كربلاء'),(101,67,N'بابل'),(102,67,N'ذي قار'),(103,67,N'ميسان'),
(104,67,N'المثنى'),(105,67,N'القادسية'),(106,67,N'صلاح الدين'),
(107,156,N'صنعاء'),(108,156,N'عدن'),(109,156,N'تعز'),(110,156,N'الحديدة'),(111,156,N'إب'),
(112,156,N'ذمار'),(113,156,N'حضرموت'),(114,156,N'حجة'),(115,156,N'صعدة'),(116,156,N'شبوة'),
(117,156,N'البيضاء'),(118,156,N'لحج'),(119,156,N'مأرب'),(120,156,N'عمران'),(121,156,N'المحويت'),
(122,156,N'الجوف'),(123,156,N'ريمة'),(124,156,N'أبين'),(125,156,N'الضالع'),(126,156,N'المهرة'),(127,156,N'سقطرى'),
(128,79,N'بيروت'),(129,79,N'جبل لبنان'),(130,79,N'لبنان الشمالي'),(131,79,N'لبنان الجنوبي'),
(132,79,N'البقاع'),(133,79,N'النبطية'),(134,79,N'عكار'),(135,79,N'بعلبك - الهرمل'),
(136,145,N'إسطنبول'),(137,145,N'أنقرة'),(138,145,N'إزمير'),(139,145,N'بورصة'),(140,145,N'أنطاليا'),
(141,145,N'أضنة'),(142,145,N'قونية'),(143,145,N'غازي عنتاب'),(144,145,N'مرسين'),(145,145,N'قيصري'),
(146,64,N'ماهاراشترا'),(147,64,N'كارناتاكا'),(148,64,N'تاميل نادو'),(149,64,N'دلهي'),(150,64,N'تيلانغانا'),
(151,64,N'أتر برديش'),(152,64,N'غوجارات'),(153,64,N'البنغال الغربية'),(154,64,N'راجستان'),(155,64,N'كيرلا'),
(156,110,N'البنجاب'),(157,110,N'السند'),(158,110,N'خيبر بختونخوا'),(159,110,N'بلوشستان'),(160,110,N'إسلام آباد'),
(161,151,N'كاليفورنيا'),(162,151,N'تكساس'),(163,151,N'نيويورك'),(164,151,N'فلوريدا'),(165,151,N'إلينوي'),
(166,151,N'بنسيلفانيا'),(167,151,N'أوهايو'),(168,151,N'جورجيا'),(169,151,N'ميشيغان'),(170,151,N'واشنطن'),
(171,150,N'إنجلترا'),(172,150,N'اسكتلندا'),(173,150,N'ويلز'),(174,150,N'أيرلندا الشمالية'),
(175,54,N'بافاريا'),(176,54,N'برلين'),(177,54,N'هامبورغ'),(178,54,N'هسن'),(179,54,N'شمال الراين-وستفاليا'),
(180,50,N'إيل دو فرانس'),(181,50,N'بروفانس ألب كوت دازور'),(182,50,N'أوفيرني-رون ألب'),(183,50,N'أوكسيتانيا'),
(184,27,N'أونتاريو'),(185,27,N'كيبك'),(186,27,N'كولومبيا البريطانية'),(187,27,N'ألبرتا'),
(188,8,N'نيو ساوث ويلز'),(189,8,N'فيكتوريا'),(190,8,N'كوينزلاند'),(191,8,N'أستراليا الغربية'),
(192,96,N'الدار البيضاء - سطات'),(193,96,N'الرباط-سلا-القنيطرة'),(194,96,N'مراكش-أسفي'),(195,96,N'فاس-مكناس'),(196,96,N'طنجة-تطوان-الحسيمة'),
(197,144,N'تونس'),(198,144,N'صفاقس'),(199,144,N'سوسة'),(200,144,N'قابس'),
(201,3,N'الجزائر العاصمة'),(202,3,N'وهران'),(203,3,N'قسنطينة'),(204,3,N'عنابة'),(205,3,N'البليدة'),
(206,80,N'طرابلس'),(207,80,N'بنغازي'),(208,80,N'مصراتة'),
(209,135,N'الخرطوم'),(210,135,N'الجزيرة'),(211,135,N'البحر الأحمر'),
(212,138,N'دمشق'),(213,138,N'حلب'),(214,138,N'حمص'),(215,138,N'اللاذقية'),
(216,111,N'غزة'),(217,111,N'الضفة الغربية'),(218,111,N'القدس'),
(219,129,N'مقديشو'),(220,129,N'هرجيسا'),
(221,85,N'كوالالمبور'),(222,85,N'سلاغور'),(223,85,N'جوهر'),(224,85,N'بينانق'),
(225,71,N'طوكيو'),(226,71,N'أوساكا'),(227,71,N'كيوتو'),(228,71,N'هوكايدو'),
(229,131,N'سيول'),(230,131,N'بوسان'),(231,131,N'إنتشون'),
(232,30,N'بكين'),(233,30,N'شانغهاي'),(234,30,N'غوانغدونغ'),(235,30,N'جيجيانغ'),
(236,20,N'ساو باولو'),(237,20,N'ريو دي جانيرو'),(238,20,N'ميناس جرايس'),
(239,126,N'المنطقة الوسطى'),(240,126,N'المنطقة الشرقية'),(241,126,N'المنطقة الشمالية'),(242,126,N'المنطقة الغربية');
SET IDENTITY_INSERT [TbGovernates] OFF;
            ");
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {

        }
    }
}
